// 程式設計一 !! 第二次上機考試 !! 第 3 題 (4分)
// 
//  寫一個迴圈讓玩家輸入1 2 3，分別代表剪刀、石頭、布
//  利用隨機亂數讓電腦出拳，根據玩家的輸入與電腦的出拳，
//	判斷並輸出輸贏的結果與對應贏家贏的次數，
//	直到有一邊贏的次數為三次則結束程式的執行。
//
//  要求：必須滿足以下的要求，完成指定功能才算分數
//  1. 判斷使用者的輸入必須使用 switch ... case。
//  2. 依照兩邊輸入的結果判定輸贏，並輸出贏的一方目前贏的次數。
//     請依照所給予的輸出作為程式的一部分。
// 
// 
// 參考以下的輸出結果
// 你出的是 1:剪刀, 2 : 石頭, 3 : 布 1
// 你出剪刀, 電腦出剪刀, 平手!
// 
// 你出的是 1 : 剪刀, 2 : 石頭, 3 : 布 2
// 你出石頭, 電腦出剪刀, 你贏了 1 次!
// 
// 你出的是 1 : 剪刀, 2 : 石頭, 3 : 布 3
// 你出布, 電腦出石頭, 你贏了 2 次!
// 
// 你出的是 1 : 剪刀, 2 : 石頭, 3 : 布 1
// 你出剪刀, 電腦出剪刀, 平手!
//
// 你出的是 1 : 剪刀, 2 : 石頭, 3 : 布 2
// 你出石頭, 電腦出剪刀, 你贏了 3 次!
//
// 請按任意鍵繼續 . . .
//

#define p
#ifdef p3
#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
int main(void)
{
	int a,b,as=0,bs=0;
	srand((unsigned)time(NULL));
	b = rand() % 3 + 1;
	
	// 以 rand() 取得亂數, 再轉成1,2,3 成為電腦的出拳狀態
	
	while (as < 3 && bs < 3)
	{
		printf("你出的是 1:剪刀, 2:石頭, 3:布 "); scanf("%d", &a);
		switch (a)
		{
		case 1:
		{
			if (b == 1) printf("你出剪刀,電腦出剪刀,平手!\n\n");
			else if (b == 2)
			{
				bs++;
				printf("你出剪刀,電腦出石頭,電腦贏了 %d 次!\n\n",bs);
			}
			else
			{
				as++;
				printf("你出剪刀,電腦出布,你贏了 %d 次!\n\n", as);
			}
			break;
		}

		case 2:

		{
			if (b == 1) {
				as++;
				printf("你出石頭,電腦出剪刀,你贏了 %d 次!\n\n", as);
			}
			else if (b == 2) ("你出石頭,電腦出石頭,平手!\n\n");
			else {
				bs++;
				printf("你出石頭,電腦出布,電腦贏了 %d 次!\n\n",bs);
			}
			break;
		}
		case 3:
		{
			if (b == 1) {
				bs++;
				printf("你出布,電腦出剪刀,電腦贏了 %d 次!\n\n", bs);
			}
			else if (b == 2) {
				as++;
				printf("你出布,電腦出石頭,你贏了 %d 次!\n\n", as);
			}
			else printf("你出布,電腦出布,平手!\n\n");
			break;
		}
		}
	}



	system("pause");
	return 0;
}

//
// printf("你出剪刀,電腦出剪刀,平手!\n\n");
// printf("你出剪刀,電腦出石頭,電腦贏了 %d 次!\n\n");
// printf("你出剪刀,電腦出布,你贏了 %d 次!\n\n");
// printf("你出石頭,電腦出剪刀,你贏了 %d 次!\n\n");
// printf("你出石頭,電腦出石頭,平手!\n\n");
// printf("你出石頭,電腦出布,電腦贏了 %d 次!\n\n");
// printf("你出布,電腦出剪刀,電腦贏了 %d 次!\n\n");
// printf("你出布,電腦出石頭,你贏了 %d 次!\n\n");
// printf("你出布,電腦出布,平手!\n\n");
//

#endif