// 程式設計一 !! 第二次上機考試 !! 第 4 題 (1+1+2分)
// 
//  輸入一個介於 8 到 12 之間的偶數，並儲存到整數變數 n 中，
//	計算並輸出以下兩個部分的結果
// 
//  程式必須能判斷是否輸入正確的介於 8 到 12 間的偶數
// 
//  part 1: 
//	     宣告一個一維陣列來儲存費氏係數，計算並輸出前費氏係數的前 n 項結果
//       使用一個迴圈來計算並儲存費氏係數到陣列中
//		 再用另一個迴圈來輸出儲存在陣列中的結果
//  part 2:
//	     計算 1 + 1/5 + 3/5^2 + 3^2/5^3 +... +  3^(n-2)/5^(n-1) 的總和
//  要求：
//       1. 輸入的判斷使用 do...while，另兩個 part 的迴圈必須使用 for 來實現
//		 2. part 2 不能使用 pow 函式，否則 part 2 不予計分
// 
//  計分方式：
//  1. 完成輸入判斷 1 分
//  2. Part1 1 分，Part2  2 分
// 
// 參考以下的輸出
//
// 輸入一個介於 8 到 12 間的偶數 : a
// 輸入一個介於 8 到 12 間的偶數 : 6
// 輸入一個介於 8 到 12 間的偶數 : 13
// 輸入一個介於 8 到 12 間的偶數 : 8
// ------------------- Part 1 -------------------
// f[1] = 1
// f[2] = 1
// f[3] = 2
// f[4] = 3
// f[5] = 5
// f[6] = 8
// f[7] = 13
// f[8] = 21
// ------------------- Part 2 -------------------
// 第  1 項為  1.00000，前  1 項總和為  1.000000
// 第  2 項為  0.20000，前  2 項總和為  1.200000
// 第  3 項為  0.12000，前  3 項總和為  1.320000
// 第  4 項為  0.07200，前  4 項總和為  1.392000
// 第  5 項為  0.04320，前  5 項總和為  1.435200
// 第  6 項為  0.02592，前  6 項總和為  1.461120
// 第  7 項為  0.01555，前  7 項總和為  1.476672
// 第  8 項為  0.00933，前  8 項總和為  1.486003
//

#define P
#ifdef P4

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
	int n;	/* 使用者輸入的 n 項值 */

	do
	{
		printf("輸入一個介於 8 到 12 間的偶數 : ");
		scanf("%d", &n); // 記得要使用回傳值來判斷是否輸入正確
		rewind(stdin);
	} while ((n < 8) || (n > 12) || (n % 2 != 0));
		

	// -------------------------- Part 1 --------------------------
	printf("------------------- Part 1 -------------------\n");

	int a[100];
	a[0] = 0;
	a[1] = 1;
	for (int i = 2; i < n+1; i++)
	{
		a[i] = a[i - 2] + a[i - 1];
	}
	for (int i = 1; i < n+1; i++)
	{
		printf("f[%d] = %d\n",i,a[i]);
	}



	// -------------------------- Part 2 --------------------------
	printf("------------------- Part 2 -------------------\n");
	float up = 1.0f/3.0f, down = 1.0f, sum = 1, aa;

	for (int i = 1; i < n+1; i++)
	{	
		up = up * 3;
		down = down * 5;
		aa = (up / down);
		sum = sum + aa;
		printf("第 %2d 項為 %8.5f，前 %2d 項總和為 %10.6f\n",i,aa,i,sum);
	}




	system("pause"); return(0);
}

#endif

