// 程式設計一 !! 第二次上機考試 !! 第 8 題 (3分)
//
//  宣告一個陣列可以儲存50個整數，設定初始值為以下所給的 50 個數值。
// { 3, 32, 40, 35, 10, 30, 23, 21, 33, 16,
//   4, 31, 14, 24, 17, 27,  7,  0, 38,  2,
//  11, 20, 26, 49, 42, 28,  6, 43,  5, 22,
//  47, 29,  1, 45, 37, 18, 19, 41,  8, 13,
//  36, 15, 39, 34, 46, 44, 12, 25, 48,  9};
//  
//  寫一個程式計算這個陣列中共包含幾個循環，並算出循環的平均長度。
//  循環的計算說明：
//      假設陣列 A 儲存 6 個整數，對應於陣列索引值 0 到 5，分別是 0,3,4,1,5,2，圖示如下
//      [0][1][2][3][4][5] <- 陣列 A 索引值
//       0  3  4  1  5  2  <- 對應的儲存內容
//   
//   A[0] 儲存為 0，以 0 為索引值，剛好回到起始的 A[0]，A[0]本身形成一個循環，長度為 1。
//		  輸出為： 0, 長度 1
//   A[1] 儲存為 3，以 3 為索引值，A[3]的內容為 1，再以 1 為索引值，
//        剛好回到起始的A[1]，所以A[1]與 A[3] 形成一個循環，長度為 2
//        輸出為： 1, 3, 長度 2
//   A[2] 儲存為 4，以 4 為索引值，A[4]的內容為 5，以 5 為索引值，A[5]的內容為 2
//        剛好回到起始的 A[2]，所以 A[2]、A[4] 與 A[5] 形成一個循環，長度為 3
//        輸出為： 2, 4, 5, 長度 3
// 
// 要求：每一個循環都必須輸出而且【只能輸出一次】，否則不與計分
// 
//  參考輸出如下：
// 
//  0, 3, 35, 18, 38, 8, 33, 45, 44, 46, 12, 14, 17, 長度 13
//  1, 32, 長度  2
//  2, 40, 36, 19, 長度  4
//  4, 10, 長度  2
//  5, 30, 47, 25, 28, 長度  5
//  6, 23, 49, 9, 16, 7, 21, 20, 11, 31, 29, 22, 26, 長度 13
//  13, 24, 42, 39, 長度  4
//  15, 27, 43, 34, 37, 41, 長度  6
//  48, 長度  1
//  共  9 個循環, 每個循環平均長度為 5.556
//

#define p
#ifdef p8

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main(void)
{
	srand((unsigned int)time(NULL));



	printf(" 長度 %2d\n");

	printf("共 %4d 個循環, 每個循環平均長度為 %3.3f\n");
	system("pause"); return 0;
}

#endif