// 程式設計一 !! 第二次上機考試 !! 第 1 題 (2+2+2分)
// 
//  計算並輸出以下的結果，每一個部份 2 分
//  本題只能使用 for 迴圈、浮點數的部分宣告使用 float 
//
//  讓使用者輸入一個整數值 n，計算以下的三個結果
// 
//  第 1 部分：費式係數前 n 項的各是多少 (用一維整數陣列來儲存)
//  費式係數第1項為 1、第2項為 2、第3項為 3、... 第 n 項 = 第 n-1 項 + 第 n-2 項
//  
//  第 2 部分：1+ 1/5 + 2/5^2 + 2^2/5^3 + ... + 2^(n-2)/5^(n-1)。 
// 
//  第 3 部分：輸出 n 層的 * 金字塔
// 
//  計分方式：兩次輸入都要完成才有分數
//
// 輸出參考
//
//	請輸入一個大於 1 的整數：2
//	----------- 第 1 部分-----------
//	f[1] = 1
//	f[2] = 1
//
//	----------- 第 2 部分-----------
//	總和為   1.200000
//
//	---------- - 第 3 部分-----------
//	*
// ***
//
//
// 請輸入一個大於 1 的整數：4
// ----------- 第 1 部分-----------
// f[1] = 1
// f[2] = 1
// f[3] = 2
// f[4] = 3
// f[5] = 5
//
// ----------- 第 2 部分-----------
// 總和為   1.324800
// 
// ----------- 第 3 部分-----------
//     *
//    ***
//   *****
//  *******
// *********
//

#define p
#ifdef p1

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
int main(void)
{
	int i, s;	/* 前 n 項的計數變數 */
	int fib[15] = { 0 };  // 儲存費式係的一維陣列數
	float tot = 0, d2 = 1.0f, d5 = 5.0f;

	int n;	/* 使用者輸入的 n 項值 */

	printf("請輸入一個大於 1 的整數："); scanf("%d",&n);
	printf("----------- 第 1 部分 -----------\n");

	fib[1] = 1; fib[2] = 1;  // 設定費氏係數的第1項為 1、第2項為 2
	for (i = 3; i <= n; i++)
	{
		fib[i] = fib[i - 1] + fib[i - 2];
	}
	for (i = 1; i <= n; i++) 
		printf("f[%d] = %d\n", i, fib[i]);

	printf("\n----------- 第 2 部分 -----------\n");
	tot = 1;
	for (i = 1; i < n; i++) {
		tot = tot + d2 / d5;
		d2 = d2 * 2.0f;
		d5 = d5 * 5.0f;
	}
	printf("總和為 %10.6f\n",tot);

	printf("\n----------- 第 3 部分 -----------\n");
	int a, j;
	for (i = 1; i <= 2*n-1; i += 2) {
		a = (2*n - i) / 2; // 前面需空出的空間
		for (j = 1; j <= a; j++) printf(" ");
		for (j = 1; j <= i; j++) printf("*");
		printf("\n");
	}
	system("pause"); return(0);
}

#endif