// 程式設計一 第一次上機寫題，第二題 (2+3分)
//
//	 假設：美式咖啡售價 60 元、抹茶拿鐵售價是美式的 1.5 倍
//	       加奶每杯多 15 元
//
//   每次依序詢問要購買的美式杯數、抹茶拿鐵杯數、加奶杯數
//   總價 = 美式與抹茶拿鐵的飲料錢 + 加奶的錢
//   總杯數只算美式與抹茶拿鐵（加奶不算杯數）
//
//	 需求一：
//			 當總價超過(含) 1000 時售價打 9 折
// 			 輸出應付的原價與打折後的總價
//   需求 2 :
//			詢問要購買的杯數（同上）
//			當總杯數超過(含) 15 杯時售價打 9 折，且美式與抹茶拿鐵都買 3 送 1
//          沒有滿足打折條件時，美式與抹茶拿鐵都是買 5 送 1
//			輸出應付的原價與打折後的總價以及各應給的杯數
//
//	 計分方式
//		1. 完成需求 1 , 1 分
//      2. 各品項售價以 #define 宣告為常數符號，且完成需求1的輸出， 1 分
//		3. 完成需求 2 , 2 分
//
//   提示：需使用 if...else，將兩個需求的程式碼各複製一份到對應的 printf 函式後面即可連續輸入兩次
//		   需求 1 兩次輸入分別為 6 4 3 以及 10 6 4
//		   需求 2 兩次輸入分別為 7 5 2 以及 10 8 4
//         輸出結果與下面的參考輸出相同即可。
// ---------------------------------------------------------------------------------------------
//   以下的輸出為本題輸出參考
//	------------需求 1 ------------
// 	依序輸入美式、抹茶拿鐵、加奶的杯數 : 6 4 3
//  未達打折條件，總價為: 765
//	依序輸入美式、抹茶拿鐵、加奶的杯數 : 10 6 4
//	總價為: 1200 打折後是 1080
//
// 	------------需求 2 ------------
// 	依序輸入美式、抹茶拿鐵、加奶的杯數 : 7 5 2
//  未達打折條件，總價為: 900
//	美式原購買:  7 杯, 抹茶拿鐵原購買:  5 杯
//	美式應製作:  8 杯, 抹茶拿鐵應製作:  6 杯
//
// 	依序輸入美式、抹茶拿鐵、加奶的杯數 : 10 8 4
//  總價為: 1380 打折後是 1242
//	美式原購買: 10 杯, 抹茶拿鐵原購買:  8 杯
//	美式應製作: 13 杯, 抹茶拿鐵應製作: 10 杯
//

#define P
#ifdef P2

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

	// 宣告美式(AMERICANO)60 元
	// 宣告加奶(MILK)15 元
	// 抹茶拿鐵(LATTE)的定義是美式的 1.5 倍，要用括號包起來，而且用整數運算

int main(void)
{
	// 宣告美式的杯數、抹茶拿鐵的杯數、加奶的杯數、原總價與總杯數
	// 宣告打折後的總價、美式製作的杯數、抹茶拿鐵製作的

	printf("------------  需求 1 ------------\n");
	printf("依序輸入美式、抹茶拿鐵、加奶的杯數 : "); scanf("%d%d%d", &, &, &);

	// 計算原總價

	    // 條件判斷當總價超過(含) 1000 時售價打 9 折
	        printf("總價為: %d 打折後是 %d \n", , );
	        printf("未達打折條件，總價為: %d \n", );
	rewind(stdin);
	// 以下複製貼需求一上面寫好的程式碼到這裡，就不用執行兩次了



	printf("\n------------  需求 2 ------------\n");
	printf("依序輸入美式、抹茶拿鐵、加奶的杯數 : "); scanf("%d%d%d", , , );

	// 計算原總價
    // 計算總杯數

	    // 條件判斷當總杯數超過(含) 15 杯時打 9 折，美式與抹茶拿鐵都買 3 送 1
	        printf("總價為: %d 打折後是 %d \n", , );

	    // 當沒有滿足打折條件時，美式與抹茶拿鐵都是買 5 送 1
	        printf("未達打折條件，總價為: %d \n", );

	printf("美式原購買: %2d 杯, 抹茶拿鐵原購買: %2d 杯\n", , );
	printf("美式應製作: %2d 杯, 抹茶拿鐵應製作: %2d 杯\n\n", , );

	rewind(stdin);
	// 以下複製貼需求二寫好的程式碼到這裡，就不用執行兩次了



	system("pause"); return(0);
}

#endif