// 程式設計一 第一次上機寫題，第三題 (4分)
//
// 輸出 20 到 120 間所有數的總和，以及所有偶數的和、所有奇數的和與所有 5 的倍數的和
//
// 參考以下的輸出結果
//
// 20+...+120 = 7070
// 奇數和 = 3500
// 偶數和 = 3570
// 5 的倍數和 = 1470
//

#define P
#ifdef P3

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
	// 宣告 int 變數：目前的數字 i，以及四個總和（奇數、偶數、5 的倍數、全部）
	// 設定 i 的起始值為 20，四個總和的起始值都設為 0

	while () {
		// 判斷 i 是奇數還是偶數，分別加到奇數的和與偶數的和
		// 判斷 i 是不是 5 的倍數，是就加到 5 的倍數的和（與奇偶無關，要另外寫一個 if）
		// 不論是哪一種，都要加到全部的總和
		// i 往下一個數
	}

	printf("20+...+120 = %d\n奇數和 = %d\n偶數和 = %d\n5 的倍數和 = %d\n\n", , , , );

	system("pause"); return(0);
}

#endif