// 程式設計一 !! 第二次上機考試 !! 第 1 題 (2+3分)
// 
//  達成輸入要求對應的輸出，
// 
//  1. 判斷使用者輸入大於 2 且小於(不含等於) 11 的奇數，這個數是後續計算的第 n 項 (2分)
//     本項計分只有在 2.的要求完成才計分
// 
//  2. 計算 2 + 2^2/5 + 2^3/5^2 + 2^4/5^3 + ... + 2^(n)/5^(n-1)。 (3分)(可只寫這題)
// 
//  輸入大於 2 且小於(不含等於) 11 的奇數 : 4
//  輸入大於 2 且小於(不含等於) 11 的奇數 : a
//  輸入大於 2 且小於(不含等於) 11 的奇數 : 11
//  輸入大於 2 且小於(不含等於) 11 的奇數 : 9
// 
//  2 + 2^2/5 + 2^3/5^2 + ... + 2^(n)/5^(n-1) = 3.3324594498
//  

#define us
#ifdef use

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
int main() {
	int n, i;
	float sum = 0;
				
	do {
		printf("輸入大於 2 且小於(不含等於) 11 的奇數: ");
		scanf("%d", &n);
		rewind(stdin);
	} while (n <= 2 || n >= 11 || n % 2 == 0);
	for (i = 1; i <= n; i++)
	{
		sum += (pow(2, i) / pow(5, i - 1));
	}
	printf("2 + 2^2/5 + 2^3/5^2 + ... + 2^(n)/5^(n-1) = %4.10f\n", sum);

	return(0);
}

#endif