// 程式設計一 !! 第二次上機考試 !! 第 1 題 (4/6分)
// 
//  達成輸入要求並計算兩項對應的輸出，每一項要求 2 分
// 
//  1. 判斷使用者輸入一個大於 3 的奇數，這個數就是後續兩個計算的第 n 項 (2分)
//     本項計分只有在後續 2 或 3 完成一個才計分
// 
//  2. 計算 3 + 3^2/7 + 3^3/7^2 + 3^4/7^3 + ... + 3^(n+1)/7^(n-1)。 (2分)
// 
//  3. 計算並輸出前 n+1 項，Fn = 3*F(n-1) - F(n-2), 其中 F1 = 1, F2 = 1,  (2分)
//     第 n 項等於 3 倍的第 n-1 項減去 第 n-2 項
//     此部分使用一維陣列來儲存計算後的結果與輸出
// 
//  輸入一個大於等於 3 小於(不含等於) 13 的奇數 : a
//  輸入一個大於等於 3 小於(不含等於) 13 的奇數 : 4
//  輸入一個大於等於 3 小於(不含等於) 13 的奇數 : 13
//  輸入一個大於等於 3 小於(不含等於) 13 的奇數 : 7
// 
//  ---------- - 第 1 部分---------- -
//  3 + 3^2/7 + ... + 3^(n)/ 7^(n-1) = 5.2360582352
//
//  ---------- - 第 2 部分---------- -
//  F1 = 1
//  F2 = 1
//  F3 = 2
//  F4 = 5
//  F5 = 13
//  F6 = 34
//  F7 = 89
//  F8 = 233
//

#define p
#ifdef p1

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
int main(void)
{
	int n;	/* 使用者輸入的 n 項值 */
			/* 宣告儲存 Fn 的一維陣列, = { 0 } 補在宣告的後面 */
			// 其他變數宣告
				
	do
	{
		printf("輸入一個大於等於 3 小於(不含等於) 13 的奇數: ");
		scanf("%d", &n);
		rewind(stdin);
	} while (n<3||n>=13||n%2==0);
		


	printf("----------- 第 1 部分 -----------\n");
	float y=3.0f;
	float b = 0;
	

	for (int i = 1; i <= n; i++)
	{
		b += y;
		y = y *3.0f/7.0f;
	}
	printf("3 + 3^2/7 + ... + 3^(n+1)/7^(n-1) = %4.10f\n", b);
	printf("\n----------- 第 2 部分 -----------\n");
	int a[9];
	// F1 = 1, F2 = 1,
	a[0] = 1;
	a[1] = 1;
	// 計算 Fn
	for (int i = 2; i <=n; i++)
	{
		a[i] =3*a[i - 1] -a[i - 2]  ;
	}
	for (int i = 0; i <=n; i++)
	{
		printf("F%d = %5d\n", i+1,a[i] );
	}
	//  輸出 Fn
	
	//
	
	printf("\n");

	system("pause"); return(0);
}

#endif