// 程式設計一 第一次上機寫題，第四題 (2 分)
//
//  撰寫 xp 與 xs 兩個函式，兩個函式都沒有回傳且都只接受一個 int 型別的引數 n
//  xp 功能是水平輸出 n 個 * 後再輸出一個換行 <- 要輸出換行喔
//  xs 功能是水平輸出 n 個空白即可，不須額外輸出換行
//  
//	讓使用者輸入所需的輸出的金字塔層數，並輸出對應的圖形 
// 
//  必須完成以下兩個功能使得計分
//	1. 必須完成 xp 與 xs 的功能
//  2. 必須能依照所指定的層數輸出指定的圖形
// 
// 參考輸出如下：
//  輸入層數: 4
//     *
//    ***
//   *****
//	*******
// 
//  輸入層數: 6
//	     *
//      ***
//     *****
//    *******
//   *********
//  ***********
//  	
   
#define E
#ifdef E4

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

// xp 函式


// xs 函式


int main(void)
{

	printf("輸入層數: "); scanf("%d", &); // 輸入層數

	// while 的條件判斷一定要用到由 strlen 所取得的字串長度



	system("pause");
	return(0);
}


#endif