// 程式設計一，第三次上機考試第 5 題 (4 分)
//
// 完成以下的函式與輸出需求 
//		genAry 函式：
//			有兩個引數,第一個為二維陣列(方陣), 第二個引數是陣列的大小
//			此處傳入的是 n*n 的二維陣列(也就是方陣, row 個數 = column 個數)
//			功能是將傳入的陣列內，產生一個 n * n 的對稱矩陣，
//			矩陣內容如下(此處說明以陣列索引編號從 0 開始)
//			1. 對角線內容從 1 開始，依序遞增. 也就是 A[i][i] = i+1, i 從 0 到 n-1
//          2. 當 i 與 j 不相同時，A[i][j] = A[j][i]，
//             A[i][j] ( i >= j 部分，也就是陣列的下三角形) 內容, 從 1 開始依序遞增
//			   參考輸出的二維陣列內容
//			3. 完成對稱陣列內容後，將水平(row)與垂直(column)方向內容加總後
//			   儲存到陣列的最後一個row 與 column 的儲存格內。
//			   參考輸出的二維陣列內容
// 
//		prnAry函式：有兩個引數,第一個是二維陣列, 第二個引數是陣列的大小
//					功能為輸出所傳入陣列的內容
// 
//      genAry 與 prnAry 都沒不用回傳值
// 
//      主程式：宣告一個 8*8 的二維整數陣列 
//			    呼叫 genAry 產生需求的對稱矩陣於傳入的陣列中
//				呼叫 prnAry 輸出陣列的內容
// 
//  要求: 你的程式必須完成上述函式的撰寫，
//        兩個函式內的迴圈終止條件的判斷都必須使用到傳入的 n  
//        完成參考輸出的執行才算分數 
//        [不可]將儲存的陣列宣告為全域變數
// 
// 參考以下的輸出
// 
//  1    1    2    4    7   11   16   42        
//  1    2    3    5    8   12   17   48        
//  2    3    3    6    9   13   18   54
//  4    5    6    4   10   14   19   62
//  7    8    9   10    5   15   20   74
// 11   12   13   14   15    6   21   92
// 16   17   18   19   20   21    7  118
// 42   48   54   62   74   92  118    0
//

#define us
#ifdef use

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>

void genAry(int A[8][8], int n) {
	int k = 1;
	for (int j = 0; j < n ; j++) {
		for (int i = 0; i < n; i++) {
			if (j > i) {
				A[i][j] = A[j][i] = k;
				k++;
			}
			A[i][i] = i+1;			
		}
	}
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			A[i][n] += A[i][j];
			A[n][j] += A[i][j];
		}
	}
	
}

void prnAry(int array[8][8], int n) {
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			printf("%5d", array[i][j]);
		}
		printf("\n");
	}
}


int main(){
	int n = 8;
	int A[8][8] = { 0 };				
	genAry(A, n - 1);				
	prnAry(A, n);				
	return(0);
}
#endif
