// 程式設計一 第一次上機寫題，第二題 (4 分)
//	 
//	 假設：紅茶售價 40 元、咖啡售價 60 元 
//   
//   需求 1 : (2 分，含常數符號宣告) 
//			詢問要購買的紅茶與咖啡杯數
//			當總價超過(含) 1200 時且總杯數超過 20 杯時售價打 9 折
// 			輸出應付的原價與打折後的總價
// 
//   需求 2 : (2 分，含常數符號宣告)  
//			詢問要購買的紅茶與咖啡杯數
//			條件1：總杯數超過(含) 40 杯。條件2：紅茶買超過 30 杯數或咖啡購買超過(含) 25 杯
// 			打折條件為條件1 與 條件2 同時成立，則售價打 85 折 
//          當滿足打折條件時，紅茶買 2 送 1、咖啡買 3 送 1
//          當沒有滿足打折條件時，紅茶與咖啡都是買 5 送 1
//			輸出應付的原價與打折後的總價以及各應給的杯數與總杯數
// 
//	 計分方式
//      輸出 Part1 且以 #define 宣告紅茶跟咖啡售價的常數符號 (2 分)
//      輸出 Part2 2 分(含常數符號宣告) 
//      本題全部用整數(int)型別計算即可
//		本題如果沒有宣告常數符號，每一個需求都只有 1 分。
// 
//   提示：需使用 if...else，並讓程式執行 2 次
//			第 1 次輸入為 10 12 以及 20 20
//			第 2 次輸入為 12 12 以及 22 25
//         輸出結果與下面的參考輸出相同即可。
// ---------------------------------------------------------------------------------------------
//   以下的輸出為本題輸出參考
//------------第一次輸入------------
//  ------------需求 1 ------------
//	依序輸入紅茶與咖啡的購買杯數 : 10 12
//	未達打折條件，總價為 : 1120
// 	
//  ------------需求 2 ------------
//  依序輸入紅茶與咖啡的購買杯數 : 20 20
//	未達打折條件，總價為 : 2000
//  紅茶原購買 : 20 杯, 咖啡原購買 : 20 杯
//	紅茶應製作 : 24 杯, 咖啡應製作 : 24 杯
//
//------------第二次輸入------------
//  ------------需求 1 ------------
//	依序輸入紅茶與咖啡的購買杯數 : 12 12
//	總價為 : 1200 打折後是 1080
// 	
//  ------------需求 2 ------------
//  依序輸入紅茶與咖啡的購買杯數 : 22 25
//	總價為 : 2380 打折後是 2023
//  紅茶原購買 : 22 杯, 咖啡原購買 : 25 杯
//	紅茶應製作 : 33 杯, 咖啡應製作 : 33 杯
//

#define E
#ifdef E2

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
						// 宣告紅茶售價的常數
						// 宣告咖啡售價的常數

int main(void)
{

	printf("------------  需求 1 ------------\n");
	printf("依序輸入紅茶與咖啡的購買杯數 : "); scanf("%d%d", &, &);

	// 當總價超過(含) 1200 時且總杯數超過 20 杯時售價打 9 折

	printf("總價為: %d 打折後是 %d \n", , );

	printf("未達打折條件，總價為: %d \n",);


	printf("\n------------  需求 2 ------------\n");
	printf("依序輸入紅茶與咖啡的購買杯數 : "); scanf("%d%d", &, &);


	//條件1：總杯數超過(含) 40 杯。條件2：紅茶買超過 30 杯數或咖啡購買超過(含) 25 杯
	//打折條件為條件1 與 條件2 同時成立，則售價打 85 折 


	// 當滿足打折條件時，紅茶買 2 送 1、咖啡買 3 送 1

	printf("總價為: %d 打折後是 %d \n", , );

	// 當沒有滿足打折條件時，紅茶與咖啡都是買 5 送 1

	printf("未達打折條件，總價為: %d \n", );
	
	printf("紅茶原購買: %2d 杯, 咖啡原購買: %2d 杯\n", , );
	printf("紅茶應製作: %2d 杯, 咖啡應製作: %2d 杯\n", , );

	system("pause"); return(0);
}

#endif