// 程式設計一 第一次上機寫題 第三題 (2 分)
//
// (1分) Part 1 : 輸出 50 到 500 間是偶數但被 3 除餘 2 的所有數值的總和
// (1分) Part 2 : 輸出 20 到 200 間【同時滿足】條件1 與條件2 的所有數值的總和
//				   條件1： 奇數或被 5 除餘 2
//				   條件2： 可被 3 整除或不能被 7 整除
//
// 參考以下的輸出結果
// 
// Part 1  -------------------------------------------------------
// 50--500 間是偶數但被 3 除餘 2 = 20900
// 
// Part 2  -------------------------------------------------------
// 20--200 間滿足兩個條件數值得總和 = 10692
//

#define E
#ifdef E3

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

int main(void)
{

	// 輸出 50 到 500 間
	// 記得重新設定迴圈的起始值

	// 偶數但被 3 除餘 2


	// 20 到 200 間，記得重新設定迴圈的起始值


	// 條件1： 奇數或被 5 除餘 2
	// 條件2： 可被 3 整除或不能被 7 整除

	printf("Part 1	-------------------------------------------------------\n");
	printf("50--500 間是偶數但被 3 除餘 2 = %6d\n", );

	printf("\nPart 2	-------------------------------------------------------\n");
	printf("20--200 間滿足兩個條件數值得總和 = %6d\n\n", );

	system("pause"); return(0);
}

#endif