// 程式設計一 第一次上機寫題，第七題 (2 分)
//
//  延續第 4 題的 xp 與 xs 函式，由主程式呼叫這兩個函式
//  分別完成以下兩個圖形的輸出，每一個圖形 1 分
// 
// 參考以下的輸出 (Part1 與 Part2 的輸出測試都包含 3 跟 5)
//  Part 1  ------------------------------------------------------ -
//  輸入層數: 5
//      *
//     ***
//    *****
//   *******
//  *********
//   *******
//    *****
//     ***
//      *
//  Part 2  ------------------------------------------------------ -
//          **
//          **
//        ******
//        ******
//      **********
//      **********
//    **************
//    **************
//  ******************
//  ******************
//

#define E
#ifdef E7

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>


// xp 函式


// xs 函式

int main(void)
{
	int n, i = 1;

	printf("Part 1	-------------------------------------------------------\n");
	printf("輸入層數: "); scanf("%d", &); // 輸入層數


	printf("Part 2	-------------------------------------------------------\n");



	system("pause");
	return 0;
}
#endif