// 程式設計一 第一次上機寫題，第八題 (2 分)
//
//  輸入一個以數字所組成的字串，然後執行以下兩個功能
//  功能1：將字串的頭尾依序將兩個對應的字元對調，也就是以字串的中間為基準進行鏡射的操作
//         例如：輸入字串為 0124，則 0 與 4 對調、1 與 2 對調，鏡射字串為 4210
//               輸入字串為 012468，則 0、8 對調，1、6 對調，2、4 對調，鏡射字串為 864210
//  功能2：將鏡射過後的字串，從頭到尾，依序的兩個兩個一組，變成一系列的二位數，
//		   計算並輸出這些二位數的相加結果
//		   例如：0124 鏡射後為 4210，兩組二位數為 42 與 10，相加結果為 52
//		         012468 鏡射後為 864210，三組二位數為 86、42、10，相加結果為 138
// 
// 參考輸出如下：
//  輸入由數字組成的字串: 0123456789
//  原始字串 0123456789
//  鏡射字串 9876543210
//  98  76  54  32  10   總和為 : 270
//

#define E
#ifdef E8

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main(void)
{


	printf("輸入由數字組成的字串: "); scanf("%s",); // 輸入一串數字
	printf("原始字串 %s\n", );


	printf("鏡射字串 %s\n", );


	printf("%4d", );

	printf("   總和為 : %d \n", );

	system("pause");
	return(0);
}


#endif