// 程式設計一，第三次上機考試第 1 題 (3+2 分)
//
// 利用遞迴呼叫完成河內塔指定環數的搬動過程，並同時輸出總共的搬動次數
// 
// 計分方式：
//	   輸出搬動過程 : 3 分
//     輸出搬動次數 : 2 分，此分數只有在輸出完整搬動過程才算分
// 
// 符合以下的要求並輸出正確才算分數： 
//   1. 函式 Hanoi 必須寫在 main 之後，所以必須寫出原型宣告
//   2. 搬動次數的輸出必須是來自 Hanoi 函式的回傳值
//   3. 直接輸出 2^n-1 為搬動次數第二部分不算分
// 
//  參考以下的輸出
//
// 有多少圓盤要搬: 4
// 將第 1 個圓盤從塔 1 搬到塔 2
// 將第 2 個圓盤從塔 1 搬到塔 3
// 將第 1 個圓盤從塔 2 搬到塔 3
// 將第 3 個圓盤從塔 1 搬到塔 2
// 將第 1 個圓盤從塔 3 搬到塔 1
// 將第 2 個圓盤從塔 3 搬到塔 2
// 將第 1 個圓盤從塔 1 搬到塔 2
// 將第 4 個圓盤從塔 1 搬到塔 3
// 將第 1 個圓盤從塔 2 搬到塔 3
// 將第 2 個圓盤從塔 2 搬到塔 1
// 將第 1 個圓盤從塔 3 搬到塔 1
// 將第 3 個圓盤從塔 2 搬到塔 3
// 將第 1 個圓盤從塔 1 搬到塔 2
// 將第 2 個圓盤從塔 1 搬到塔 3
// 將第 1 個圓盤從塔 2 搬到塔 3
// 4 個環共搬動 15 次
//

#define p
#ifdef p1

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

int Hanoi(int n, int s,int m,int d);// Hanoi 函式原型宣告



int main(void)
{
	int n, ret = 0;
	printf("有多少圓盤要搬: ");	scanf("%d", &n);
	ret = Hanoi(n, 1, 2, 3);
	 // 呼叫 Hanoi 函式，ret 取得回傳的般動次數
	printf("%d 個環共搬動 %d 次\n", n, ret);
	system("pause"); return(0);
}
int Hanoi(int n, int s, int m, int d)
{
	int k = 1;
	if (n == 1)
	{
		printf("將第%2d 個圓盤從塔%2d 搬到塔%2d\n", n, s, d);
		k++;
		return(1);
		
	}
	else
	{

		k += Hanoi(n - 1, s, d, m);
		printf("將第%2d 個圓盤從塔%2d 搬到塔%2d\n", n, s, d);

		k += Hanoi(n - 1, m, s, d);
		

	}

}
#endif

// printf("將第%2d 個圓盤從塔%2d 搬到塔%2d\n");
//
//
