// 程式設計一 第一次上機寫題，第 8 題 (3 分)
//
//  根據 str 字元陣列所儲存的內容，取奇數索引值內(也就是 str[1]、str[3]、str[5]...)的字元進行判斷
//  如果該字元所對應的數字是偶數，則對換該儲存格前後儲存格的字元內容
//      以 str[1] 為例， str[1] 裡面放的字元 2，2 這個數是偶數，則對調 str[0] 與 str[2] 的內容
//	       也就是對調後的 str 字串內容為 "621584739"
//  如果該字元所對應的數字是奇數，則該儲存格的前一個儲存格的字元內容加1，後一個儲存格的字元內容加 2
//      以 str[3] 為例， str[3] 裡面放的字元 5，5 這個數是奇數，則對前一個 str[2] 的內容加 1 與後一個 str[4] 的內容加 2
//	       也就是處理後的 str 字串內容為 "622504739"
//         注意：當 8 + 2 = 10 時，存放的字元必須是 0，也就是字元的累加是 0 1 2 ... 9 0 1 2 3... 的循環
// 
//  處理後的 str 字元陣列的內容，再依序的三個字元三個字元一組，轉成三個三位數，
//	    輸出對應的三位數內容，並計算其加總的結果
// 
//	計分要求
//		1. 以 strlen 來取得字串的長度，並以迴圈的執行來完成上述兩個需求才有分數
//		2. 如果以【暴力法】求解，就是逐一的處理奇數字元，而不使用 while 迴圈，本題不予計分
// 
//  提示 : 0 的 ASCII 編碼是 48、1 的 ASCII 編碼是 49...
// 
// 參考輸出如下：
//	原始的字串 : 126584739
//	處理後字串 : 622574131
//	三位數共有 : 622 574 131
//	總和為 1327
// 
// 各奇數位置處理後的 str 內容，供執行檢測用
//  621584739  <- 處理 str[1] 後
//  622504739  <- 處理 str[3] 後
//  622574039  <- 處理 str[5] 後
//  622574131  <- 處理 str[7] 後
//
 
#define P
#ifdef P8

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main(void)
{
	char str[20] = "126582769";

	
	printf("原始的字串 : %s\n", str);  // 原始字串
							// 使用 strlen 取得的字串長度
	while (  ) // 這裡一定要用到由 strlen 所取得的字串長度
	{


		// printf("%s\n", str); // 各奇數位置處理後的 str 內容，供執行檢測用

	}
	printf("處理後字串 : %s\n", str);  // 處理後字串

	printf("三位數共有: ");

	while ( ) // 這裡一定要用到由 strlen 所取得的字串長度
	{

		printf("%4d",);

	}
	printf("\n總和為 %d\n");

	system("pause");
	return(0);
}
#endif