// 程式設計一 第一次上機寫題，第 1 題 (1+2+1分)
//	 
//	 假設：紅茶售價 30 元、咖啡售價是紅茶的兩倍 
//   
//   詢問要購買的紅茶與咖啡杯數，
//	 需求一：
//			 當總價超過(含) 1400 時且總杯數超過 30 杯時售價打 9 折
// 			 輸出應付的原價與打折後的總價
//   需求 2 :
//			詢問要購買的紅茶與咖啡杯數
//			條件1：總杯數超過(含) 50 杯。
//			條件2：紅茶買超過(含) 35 杯數或咖啡購買超過 20 杯
// 			同時滿足條件1 與 條件2 時售價打 85 折，且紅茶買 2 送 1、咖啡買 3 送 1
//          沒有滿足打折條件時，紅茶與咖啡都是買 4 送 1
//			輸出應付的原價與打折後的總價以及各應給的杯數與總杯數
// 
//	 計分方式
//		1. 完成需求 1 , 1 分
//      2. 紅茶與咖啡售價以 #define 宣告為常數符號，且完成需求1的輸出， 1 分
//		3. 完成需求 2 , 2 分
// 
//   提示：需使用 if...else，將兩個需求的程式碼各複製一份到對應的 printf 函式後面即可連續輸入兩次
//		   需求 1 兩次輸入分別為 15 15 以及 20 20
//		   需求 2 兩次輸入分別為 30 20 以及 40 20
//         輸出結果與下面的參考輸出相同即可。
// ---------------------------------------------------------------------------------------------
//   以下的輸出為本題輸出參考
//	------------需求 1 ------------
// 	依序輸入紅茶與咖啡的購買杯數 : 15 15
//  未達打折條件，總價為 : 1350
//	依序輸入紅茶與咖啡的購買杯數 : 20 20
//	總價為 : 1800 打折後是 1620
//	
// 	------------需求 2 ------------
// 	依序輸入紅茶與咖啡的購買杯數: 30 20
//  未達打折條件，總價為 : 2100
//	紅茶原購買 : 30 杯, 咖啡原購買 : 20 杯
//	紅茶應製作 : 37 杯, 咖啡應製作 : 25 杯
//	
// 	依序輸入紅茶與咖啡的購買杯數 : 40 20
//  總價為 : 2400 打折後是 2040
//	紅茶原購買 : 40 杯, 咖啡原購買 : 20 杯
//	紅茶應製作 : 60 杯, 咖啡應製作 : 26 杯
//	

#define P
#ifdef P1

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
	
#define TEA 30			// 宣告紅茶(TEA)售價的常數
#define COFFEE TEA * 2	// 宣告咖啡(COFFEE)售價的常數

int main(void)
{
	int tea, coffee, tp, tc;	// 宣告紅茶、咖啡購買的杯數、總價與總杯數等相關變數
	int tp2, tea2, coffee2;	// 宣告打折後的總價、紅茶製作的杯數、咖啡製作的杯數等相關變數
	
	printf("------------  需求 1 ------------\n");
	printf("依序輸入紅茶與咖啡的購買杯數 : "); scanf("%d%d", &tea, &coffee);

	tp = tea * TEA + coffee * COFFEE;
	tc = tea + coffee;

	if (tp >= 1400 && tc > 30) {	// 當總價超過(含) 1400 時且總杯數超過 30 杯時售價打 9 折
		tp2 = tp * 0.9;
		printf("總價為: %d 打折後是 %d \n", tp, tp2);
	}
	else {
		printf("未達打折條件，總價為: %d \n", tp);
	}
	rewind(stdin);
	// 以下複製貼需求一寫好的程式碼到這裡，就不用執行兩次了
	printf("依序輸入紅茶與咖啡的購買杯數 : "); scanf("%d%d", &tea, &coffee);

	tp = tea * TEA + coffee * COFFEE;
	tc = tea + coffee;

	if (tp >= 1400 && tc > 30) {	// 當總價超過(含) 1400 時且總杯數超過 30 杯時售價打 9 折
		tp2 = tp * 0.9;
		printf("總價為: %d 打折後是 %d \n", tp, tp2);
	}
	else {
		printf("未達打折條件，總價為: %d \n", tp);
	}




	printf("\n------------  需求 2 ------------\n");
	printf("依序輸入紅茶與咖啡的購買杯數 : "); scanf("%d%d", &tea, &coffee);

	// 條件1：總杯數超過(含) 50 杯。
	// 條件2：紅茶買超過(含) 35 杯數或咖啡購買超過 20 杯
	// 打折條件為條件1 與 條件2 同時成立，則售價打 85 折 

	tp = tea * TEA + coffee * COFFEE;
	tc = tea + coffee;

	if (tc >= 50 && ((tea >= 35) ||(coffee > 20))) {
		// 當滿足打折條件時，紅茶買 2 送 1、咖啡買 3 送 1
		tp2 = tp * 0.85;
		tea2 = tea + tea / 2;
		coffee2 = coffee + coffee / 3;
		printf("總價為: %d 打折後是 %d \n", tp, tp2);

	}
	else {
		// 當沒有滿足打折條件時，紅茶與咖啡都是買 4 送 1
		tea2 = tea + tea / 4;
		coffee2 = coffee + coffee / 4;
		printf("未達打折條件，總價為: %d \n", tp);
	}

	printf("紅茶原購買: %2d 杯, 咖啡原購買: %2d 杯\n", tea, coffee);
	printf("紅茶應製作: %2d 杯, 咖啡應製作: %2d 杯\n\n", tea2, coffee2);

	rewind(stdin);
	// 以下複製貼需求二寫好的程式碼到這裡，就不用執行兩次了
	printf("依序輸入紅茶與咖啡的購買杯數 : "); scanf("%d%d", &tea, &coffee);

	// 條件1：總杯數超過(含) 50 杯。
	// 條件2：紅茶買超過(含) 35 杯數或咖啡購買超過 20 杯
	// 打折條件為條件1 與 條件2 同時成立，則售價打 85 折 

	tp = tea * TEA + coffee * COFFEE;
	tc = tea + coffee;

	if (tc >= 50 && ((tea >= 35) || (coffee > 20))) {
		// 當滿足打折條件時，紅茶買 2 送 1、咖啡買 3 送 1
		tp2 = tp * 0.85;
		tea2 = tea + tea / 2;
		coffee2 = coffee + coffee / 3;
		printf("總價為: %d 打折後是 %d \n", tp, tp2);

	}
	else {
		// 當沒有滿足打折條件時，紅茶與咖啡都是買 4 送 1
		tea2 = tea + tea / 4;
		coffee2 = coffee + coffee / 4;
		printf("未達打折條件，總價為: %d \n", tp);
	}

	printf("紅茶原購買: %2d 杯, 咖啡原購買: %2d 杯\n", tea, coffee);
	printf("紅茶應製作: %2d 杯, 咖啡應製作: %2d 杯\n\n", tea2, coffee2);



	system("pause"); return(0);
}

#endif