// 程式設計一 第一次上機寫題 第 4 題 (3 分)
//
// 根據以下的需求，計算並輸出對應的結果
// 計算 100 到 500 之間所有數，其滿足以下各條件的數值的總和
//    1. 可被 3 整除的數中，可以被 5 整除【且】能被 7 整除數的總和
//    2. 被 3 整除餘 1 的數中，可被 2 整除【或】【不能】被 4 整除數的總和
//    3. 被 3 整除餘 2 的數中，可被 5 整除【且】【不能】被 7 整除數的總和
//
// 參考以下的輸出結果
// 
// 可被 3 整除的數中，也可以被 5 跟 7 整除數的總和 = 1050
// 可被 3 整除餘 1 ， 能被 2 整除或不能被 4 整除數的總和 = 40133
// 可被 3 整除餘 2 ， 能被 5 整除但不能被 7 整除數的總和 = 7045
// 

#define P
#ifdef P4

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
	int sum1, sum2, sum3, i;
	sum1 = sum2 = sum3 = 0;
	i = 100;

	while (i <= 500) {
		if (i % 3 == 0 && i % 5 == 0 && i % 7 == 0) {
			sum1 += i;
		}
		if ((i % 3 == 1) && ((i % 2 == 0) || !(i % 4 == 0))) {
			sum2 += i;
		}
		if (i % 3 == 2 && i % 5 == 0 && !(i % 7 == 0)) {
			sum3 += i;
		}

		i++;
	}
	printf("可被 3 整除的數中，也可以被 5 跟 7 整除數的總和 = %d\n", sum1);
	printf("可被 3 整除餘 1 ， 能被 2 整除或不能被 4 整除數的總和 = %d\n", sum2);
	printf("可被 3 整除餘 2 ， 能被 5 整除但不能被 7 整除數的總和 = %d\n", sum3);
	system("pause"); return(0);
}

#endif