// 程式設計一 !! 第三次上機考試 -- 第 2 題 (3分)
//
// 撰寫 genTT 與  prnTT 函式，這兩個函式都只有一個二維陣列維的引數
// genTT 負責產生  SIZE*SIZE 的乘法表
// prnTT 必須將傳入的二維陣列乘法表，執行如下的功能
//  1. 水平相加該列所有的欄，將結果放在該列最右邊的儲存格中
//  2. 垂直相加該欄所有的列，將結果放在該欄最下邊的儲存格中
//  3. 最後一個儲存格則是存放 SIZE*SIZE 乘法表的所有總和
//
// 符合以下的要求並輸出正確才算分數：
// 1. SIZE 必須由 #define 來定義的 5 這個數值
// 2. 陣列的宣告與迴圈的終止條件都必須使用到 SIZE 常數
// 3. genTT 與 prnTT 函式主體必須寫在主程式之後，所以必須宣告對應的原型宣告
// 4. 二維陣列必須宣告在主程式中，且必須使用函式傳遞二維陣列的方式
// 5. 不能使用全域變數
// 
//  參考以下的輸出
//  1     2     3     4     5    15
//  2     4     6     8    10    30
//  3     6     9    12    15    45
//  4     8    12    16    20    60
//  5    10    15    20    25    75
// 15    30    45    60    75   225
//

#define p
#ifdef p2

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>

// SIZE 的定義放在這裡
// 
// 原型宣告放在這裡


int main(void)
{
	// 宣告 AA 的大小為 (SIZE+1)*(SIZE+1) 同時設定初始值為 0
	// 呼叫 genTT 將陣列 AA 傳過去
	// 呼叫 prnTT 將陣列 AA 傳過去

	system("pause");
	return(0);
}
// genTT 函式主體放在這裡

// prnTT 函式主體放在這裡

printf("%5d ", );
printf("\n");


#endif