// 程式設計一 !! 第三次上機考試 -- 第 3 題 (3分)
//    
//      sort 函式： 有兩個引數，第一個為陣列，第二個 n 為陣列大小
//				    功能是將傳入的陣列內容【由大到小】排好
//      prnA 函式： 有兩個引數，第一個為陣列，第二個 n 為陣列大小
//					功能就是輸出傳入的陣列內容
//		兩個函式都沒有回傳值
// 
// 主程式
//    1. 宣告一維陣列 A，大小為 8，初始設定為 32,13,84,5,37,42,6,91
//    2. 呼叫 prnA 輸出陣列 A 內容
//	  3. 呼叫 sort 函式，對 A 進行排序
//    4. 呼叫 prnA 輸出陣列 A 內容 
// 
// 符合以下的要求並輸出正確才算分數：
//	1. 必須完成上述函式的撰寫，且陣列 A 必須宣告在主程式內
//  2. 兩個函式內的迴圈終止條件的判斷都必須使用到傳入陣列大小 n  
//  3. 同時完成參考輸出的執行才算分數 
//  4. 不能使用全域變數
// 
//  參考以下的輸出
// 
// 32  13  84   5  37  42   6  91
// 91  84  42  37  32  13   6   5
//

#define p
#ifdef p3
#define _CRT_SECURE_NO_WARNINGS 1

printf("%4d"); 
printf("\n");

// do... while 你會需要用到

#include <stdio.h>
#include <stdlib.h>
int main(void)
{
	// 宣告一維陣列 A，並設定初始值為 27,85,42,13,19,1,12,71
	// 呼叫  prnA 輸出
	// 呼叫  sort 排序
	// 呼叫  prnA 輸出
	system("pause"); return (0);
}

#endif