// 程式設計一 !! 第三次上機考試 -- 第 4 題 (3分)
//    
//	宣告一個結構包含以下的資料成員
//    姓名：char 型別的一維陣列，大小為 12
//    儲存國文、英文、數學成績的三個 int 型別的變數
//    儲存平均成績的 float 型別的變數
// 主程式
//    以這個結構宣告一個結構變數
//    然後輸入姓名、三科成績，並計算平均成績儲存到這個結構變數內
//    並根據下面的參考輸出結構變數的內容
// 
// 符合以下的要求並輸出正確才算分數： 
//    1. 平均成績的計算來源必須是來是所宣告的結構變數
//    2. 姓名、三科成績與平均成績都必須儲存在所需告的結構變數
//    3. 所有的輸出都必來自所宣告的結構變數
// 
// 參考輸出結果
// 輸入姓名: QAZ
// 國文成績 : 80
// 英文成績 : 75
// 數學成績 : 90
//
// 學生 : QAZ  國文 : 80, 英文 : 75, 數學 : 90
// 平均成績為 81.67
//

#define p
#ifdef p4
#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <stdlib.h>

// 宣告結構
// 
 // 姓名
 // 國文成績
 // 英文成績
 // 數學成績
 // 平均成績

int main(void)
{
		// 宣告結構變數 stu
	printf("輸入姓名: "); scanf("%s",  );  // 輸入姓名
	printf("國文成績: "); scanf("%d", &); // 輸入國文成績
	printf("英文成績: "); scanf("%d", &); // 輸入英文成績
	printf("數學成績: "); scanf("%d", &); // 輸入數學成績
										  // 計算平均
	printf("\n學生: %s  ",  );
	printf("國文: %2d,  英文: %2d,  數學: %2d \n");
	printf("平均成績為 %5.2f\n");
	system("pause"); return(0);
}
#endif